[
    {
        "time": "2023-09-25",
        "content": "My first paper on UAV control was published in <span style='font-style: italic'>Applied and Computational Engineering Vol.9</span>. Before that, this paper had been accepted by <a href='https://2023.confmss.org/' target='_blank'>CONF-MSS 2023</a>. <br>This simple work made me get initial knowledge of research process and publications."
    },
    {
        "time": "2023-06-28",
        "content": "I received my bachelor's degree in Mechatronics Engineering from <a href='https://mve.cqu.edu.cn/' target='_blank'>College of Mechanical and Vehicle Engineering (MVE), Chongqing University</a>."
    },
    {
        "time": "2023-06-09",
        "content": "I got my intra-school exchange certificate from <a href='https://eie.cqu.edu.cn/' target='_blank'>National Elite Institute of Engineering (NEIE), Chongqing University</a>. <br>Besides, my graduation thesis <strong>Optimization of Laser Cutting Process Parameters Based on Vision Inspection</strong> was awarded as the outstanding undergraduate graduation design (thesis) of NEIE."
    },
    {
        "time": "2022-09-22",
        "content": "I obtained an intra-school exchange opportunity to <a href='https://eie.cqu.edu.cn/' target='_blank'>National Elite Institute of Engineering (NEIE), Chongqing University</a>, majoring in Intelligent Manufacturing."
    },
    {
        "time": "2022-06-03",
        "content": "My first patent named <strong>A garbage sorting device with FPGA and ARM</strong> had been granted authorization. It was enjoyable to work with partners from Fuzhou University (FZU). <br>In this project, I was responsible for the mechanical design of this garbage sorting device."
    },
    {
        "time": "2021-07-24",
        "content": "I was assigned to Mechatronics Engineering during the discipline split-flow process. <br>In this year, School of Automotive Engineering was integrated into <a href='https://mve.cqu.edu.cn/' target='_blank'>College of Mechanical and Vehicle Engineering (MVE)</a>."
    },
    {
        "time": "2019-09-06",
        "content": "I started my bachelor in Mechanical Engineering at School of Automotive Engineering, Chongqing University."
    }
]